In [2]:
use books_store_db;

# Aggregate Functions - Hands On

## Demo Database : books_store_db

### Entity-Realacionshihp (ER) Diagram:

<img src="../images/books_store_db_ER_Diagram.png" alt="books_store_db_ER_Diagram.png">

### DB Dump:

You can load the scema and data from next dump file: <a href="../dumps/books_store_db_full_dump.sql" download>books_store_db_full_dump.sql</a>

## Tasks

### Task 1

What is the price of most expensive book?

,MAX(price)
0,295.4

### Task 2

What is the book name and price of most expensive book?

,book_name,price
0,Curiosa Mathematica I,295.4

### Task 3

Select author, book_name and price of most expensive book?

TIP: use [CONCAT](https://dev.mysql.com/doc/refman/8.0/en/string-functions.html#function_concat) function for to concatenate author names in output.

,author,book_name,price
0,Charles Dodgson,Curiosa Mathematica I,295.4

### Task 4

Select author,book_name and price of all books which price is above average books price.

,author,book_name,price
0,Charles Dodgson,Alice's Adventures in Wonderland,120.0
1,Charles Dodgson,Rhyme? And Reason?,125.6
2,Charles Dodgson,Pillow Problems,89.9
3,Charles Dodgson,The Hunting of the Snark,90.5
4,Charles Dodgson,The Fifth Book of Euclid Treated Algebraically,89.5
5,Charles Dodgson,Symbolic Logic Part I,93.9
6,Charles Dodgson,The Alphabet Cipher,67.9
7,Charles Dodgson,The Game of Logic,142.9
8,Charles Dodgson,Curiosa Mathematica I,295.4
9,Charles Dodgson,Curiosa Mathematica II,200.9
10,Georgi Markov,The Truth That Killed,95.0
11,Georgi Markov,A Portrait of My Double,83.9

### Task 5

Select the book prices of most expensive book of each author?

,author_id,max_price
0,1,45.0
1,2,45.0
2,3,295.4
3,4,52.9
4,6,95.0

### Task 6

Select author,book_name and price of most expensive book of each author?

,author,book_name,price
0,Kurt Vonnegut,The Sirens of Titan,45.0
1,Kurt Vonnegut,Slaughterhouse,45.0
2,Douglas Adams,The Long Dark Tea,45.0
3,Charles Dodgson,Curiosa Mathematica I,295.4
4,Georgi Gospodinov,Time Shelter,52.9
5,Georgi Markov,The Truth That Killed,95.0

### Task 7

Select author, book name and price of all books bought by 'Ivan', sorted by book price in descending order

,author,book_name,price
0,Charles Dodgson,Curiosa Mathematica II,200.90
1,Kurt Vonnegut,The Sirens of Titan,45.00
2,Kurt Vonnegut,Slaughterhouse,45.00
3,Kurt Vonnegut,God Bless You,23.50
4,Douglas Adams,The Hitchhiker's Guide to the Galaxy,20.99
5,Georgi Gospodinov,And Other Stories,18.90

### Task 8

Select the total sum of Ivan's books orders

,SUM(b.price)
0,354.29

### Task 9

How many books each client have ordered?

,name,books_count
0,Ivan,6
1,John,3
2,Merry,2
3,Lily,2

### Task 10

How many books each client have ordered and what is the total sum each of them have paid?

,name,books_count,total_sum
0,Ivan,6,354.29
1,John,3,54.38
2,Merry,2,42.80
3,Lily,2,219.80

### Task 11

Select name, age and count of books of all clients which have ordered more than 2 books.

,name,age,books_count
0,Ivan,23,6
1,John,34,3

### Task 12

Select author, book name, pub_year and price of the most expensve book published after 1950 year

,author,book_name,pub_year,price
0,Georgi Markov,The Truth That Killed,1984,95.0

### Task 13 

Select the city names where each client lives.

Tip: use [GROUP_CONCAT](https://dev.mysql.com/doc/refman/8.0/en/aggregate-functions.html#function_group-concat) aggregate function.

,name,GROUP_CONCAT(ci.city)
0,Ivan,"Sofia,New York"
1,Merry,Paris
2,Peter,Lodon
3,Lily,Sofia

### Task14

Select author name and publishing years (if any) for each of the authors born after 1950 year.

,author,birth_year,pub_years
0,Douglas Adams,1952,"1979,1980,1982,1984,1986,1987,1988,1990,1992"
1,Georgi Gospodinov,1968,"1999,2001,2012,2020"
2,Alek Popov,1966,None

### Task 15 (advanced) 

How many books are in next price ranges:

- Group 1: 0 - 50	
- Group 2: 50 - 99
- Group 3: 100 - 199
- Group 4: >200

Tip: use [MySQL CASE Operator](https://www.w3schools.com/sql/func_mysql_case.asp) 

More on [Flow Control Operators](https://dev.mysql.com/doc/refman/8.0/en/flow-control-functions.html)

,price_range,books_count
0,Group 1: 0 - 50,27
1,Group 2. 50 - 99,10
2,Group 3. 100 - 199,3
3,Group 4. >200,2